In [1]:
import os
import requests
import glob
import pandas as pd
import matplotlib.pylab as plt
import pylab as pl
import seaborn as sns
import numpy as np
import csv

In [2]:
frequency = pd.read_csv("countries.csv")

In [3]:
frequency.head()

      country  frequency
0       India        232
1       Kenya         37
2       Sudan          5
3  Madagascar          5
4       Spain         51

In [4]:
code = pd.read_csv("nations.csv")

In [5]:
code.head()

             Name Code
0     Afghanistan   AF
1  Ã…land Islands   AX
2         Albania   AL
3         Algeria   DZ
4  American Samoa   AS

In [6]:
df = frequency.merge(code, left_on='country', right_on='Name')

In [7]:
df.head()

      country  frequency        Name Code
0       India        232       India   IN
1       Kenya         37       Kenya   KE
2       Sudan          5       Sudan   SD
3  Madagascar          5  Madagascar   MG
4       Spain         51       Spain   ES

In [8]:
df.columns

Index(['country', 'frequency', 'Name', 'Code'], dtype='object')

In [9]:
df.drop(['Name'], axis = 1, inplace = True)

In [10]:
df.head()

      country  frequency Code
0       India        232   IN
1       Kenya         37   KE
2       Sudan          5   SD
3  Madagascar          5   MG
4       Spain         51   ES

In [11]:
df.shape

(142, 3)

In [12]:
df.to_csv(r'merged.csv')

## add 2 digit nations abbreviations

In [21]:
nations = pd.read_csv("nations_2digit.csv")

In [23]:
nations.head()

             Name Code
0     Afghanistan   AF
1  Ã…land Islands   AX
2         Albania   AL
3         Algeria   DZ
4  American Samoa   AS

In [25]:
df = df.merge(nations, left_on='Country', right_on='Name')

In [26]:
df.head()

                Country  Unemployment  Motor                  Name Code
0           Afghanistan         8.706     28           Afghanistan   AF
1                Angola         7.306     38                Angola   AO
2               Albania        17.490    124               Albania   AL
3  United Arab Emirates         2.282    313  United Arab Emirates   AE
4             Argentina         7.270    314             Argentina   AR

In [28]:
df['Code'] = df['Code'].str.lower()

In [29]:
df.head()

                Country  Unemployment  Motor                  Name Code
0           Afghanistan         8.706     28           Afghanistan   af
1                Angola         7.306     38                Angola   ao
2               Albania        17.490    124               Albania   al
3  United Arab Emirates         2.282    313  United Arab Emirates   ae
4             Argentina         7.270    314             Argentina   ar

In [31]:
df.drop(['Name'], axis = 1, inplace = True)

In [32]:
df.to_csv(r'merged_code.csv')